РП/src/Documents/РаспределениеПрочихЗатрат/РаспределениеПрочихЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеПрочихЗатрат</name>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.НДСУсловныеПродажи</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиНДСПартий</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходыНезавершенногоПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЗатратНаВыпуск</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияПоЭтапам</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияПоПодразделениям</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаспределения</name>
    <type>
      <types>EnumRef.СпособыРаспределенияСтатейРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоляСтоимостиПоПравилам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределенияПоПодразделениям</name>
    <type>
      <types>EnumRef.ТипыБазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределенияПоЭтапам</name>
    <type>
      <types>EnumRef.ТипыБазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРаспределения</name>
    <type>
      <types>EnumRef.СпособыРаспределенияСтатейРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вручную</name>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
        <types>DocumentRef.ЗаказПереработчику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпрБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоБазе</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпрБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборПоПодразделениям</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыпускиБезРаспоряжения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВыпуска</name>
      <type>
        <types>DocumentRef.ВыпускПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборПоМатериалам</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборПоВидамРабот</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборПоГруппамПродукции</name>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/InformationRegisters/ЗаданияКРасчетуСебестоимости/ЗаданияКРасчетуСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияКРасчетуСебестоимости</name>
  <comment>Технический регистр, содержит в себе данные о документах, которые необходимо пересчитать офлайновому механизму расчета себестоимости.</comment>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/СпособыРаспределенияСтатейРасходов/СпособыРаспределенияСтатейРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРаспределенияСтатейРасходов</name>
  <enumValues>
    <name>ПоПоказателюНаВсеПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ПоПоказателюНаУказанныеПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ПоПоказателюНаНижестоящиеПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ПоПоказателюНаВышестоящееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамПоПравилуПоВсемПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамВручнуюПоВсемПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениямИЭтапамПоПравилам</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениямВручнуюПоЭтапамПоПравилу</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамПоПравилуВДанномПодразделении</name>
  </enumValues>
  <enumValues>
    <name>НаДругиеСтатьиРасходов</name>
  </enumValues>
</mdclass:Enum>

РП/src/Documents/РаспределениеПрочихЗатрат/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("ОтборПоПодразделениям") Тогда
			ЭтотОбъект.ОтборПоПодразделениям.Очистить();
			Для Каждого Элемент Из ДанныеЗаполнения.ОтборПоПодразделениям Цикл
				ЭтотОбъект.ОтборПоПодразделениям.Добавить().Подразделение = Элемент.Значение;
			КонецЦикла;
		ИначеЕсли ЗначениеЗаполнено(ПравилоРаспределенияПоПодразделениям) Тогда
			Для Каждого Элемент Из ПравилоРаспределенияПоПодразделениям.ОтборПоПодразделениям Цикл
				ЭтотОбъект.ОтборПоПодразделениям.Добавить().Подразделение = Элемент.Подразделение;
			КонецЦикла;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ОтборПоМатериалам") Тогда
			ЭтотОбъект.ОтборПоМатериалам.Очистить();
			Для Каждого Элемент Из ДанныеЗаполнения.ОтборПоМатериалам Цикл
				ЭтотОбъект.ОтборПоМатериалам.Добавить().Материал = Элемент.Значение;
			КонецЦикла;
		ИначеЕсли ЗначениеЗаполнено(ПравилоРаспределенияПоЭтапам) Тогда
			Для Каждого Элемент Из ПравилоРаспределенияПоЭтапам.ОтборПоМатериалам Цикл
				ЭтотОбъект.ОтборПоМатериалам.Добавить().Материал = Элемент.Материал;
			КонецЦикла;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ОтборПоВидамРабот") Тогда
			ЭтотОбъект.ОтборПоВидамРабот.Очистить();
			Для Каждого Элемент Из ДанныеЗаполнения.ОтборПоВидамРабот Цикл
				ЭтотОбъект.ОтборПоВидамРабот.Добавить().ВидРабот = Элемент.Значение;
			КонецЦикла;
		ИначеЕсли ЗначениеЗаполнено(ПравилоРаспределенияПоЭтапам) Тогда
			Для Каждого Элемент Из ПравилоРаспределенияПоЭтапам.ОтборПоВидамРабот Цикл
				ЭтотОбъект.ОтборПоВидамРабот.Добавить().ВидРабот = Элемент.ВидРабот;
			КонецЦикла;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ОтборПоГруппамПродукции") Тогда
			ЭтотОбъект.ОтборПоГруппамПродукции.Очистить();
			Для Каждого Элемент Из ДанныеЗаполнения.ОтборПоГруппамПродукции Цикл
				ЭтотОбъект.ОтборПоГруппамПродукции.Добавить().ГруппаПродукции = Элемент.Значение;
			КонецЦикла;
		ИначеЕсли ЗначениеЗаполнено(ПравилоРаспределенияПоЭтапам) Тогда
			Для Каждого Элемент Из ПравилоРаспределенияПоЭтапам.ОтборПоГруппамПродукции Цикл
				ЭтотОбъект.ОтборПоГруппамПродукции.Добавить().ГруппаПродукции = Элемент.ГруппаПродукции;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПравилоРаспределенияПоПодразделениям)
			И Не ЗначениеЗаполнено(БазаРаспределенияПоПодразделениям)
			И Не ЗначениеЗаполнено(НаправлениеРаспределения) Тогда
			БазаРаспределенияПоПодразделениям = ПравилоРаспределенияПоПодразделениям.БазаРаспределения;
			НаправлениеРаспределения = ПравилоРаспределенияПоПодразделениям.НаправлениеРаспределения;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПравилоРаспределенияПоЭтапам) И Не ЗначениеЗаполнено(БазаРаспределенияПоЭтапам) Тогда
			БазаРаспределенияПоЭтапам = ПравилоРаспределенияПоЭтапам.БазаРаспределения;
		КонецЕсли;
		
	КонецЕсли;
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Регистрация задания к расчету себестоимости.
	РегистрыСведений.ЗаданияКРасчетуСебестоимости.СоздатьЗаписьРегистра(Дата, Ссылка, Организация);
	
	РеглУчетПроведениеСервер.ЗарегистрироватьКОтражению(ЭтотОбъект, ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВариантРаспределения <> Перечисления.СпособыРаспределенияСтатейРасходов.ПоПодразделениямИЭтапамПоПравилам Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПравилоРаспределенияПоПодразделениям");
	КонецЕсли;
	
	Если (ВариантРаспределения <> Перечисления.СпособыРаспределенияСтатейРасходов.ПоЭтапамВручнуюПоВсемПодразделениям
		И ВариантРаспределения <> Перечисления.СпособыРаспределенияСтатейРасходов.НаДругиеСтатьиРасходов
		И НЕ ЗначениеЗаполнено(ПравилоРаспределенияПоЭтапам)) Тогда
			Если ПолучитьФункциональнуюОпцию("КомплекснаяАвтоматизация") Тогда
				СообщитьОбОшибке(НСтр("ru='Не заполнено правило распределения по выпускам';uk='Не заповнено правило розподілу за випусками'"), Отказ);
			Иначе
				СообщитьОбОшибке(НСтр("ru='Не заполнено правило распределения по этапам';uk='Не заповнено правило розподілу по етапах'"), Отказ);
			КонецЕсли;
	КонецЕсли;
	
	Если ВариантРаспределения = Перечисления.СпособыРаспределенияСтатейРасходов.ПоПодразделениямВручнуюПоЭтапамПоПравилу
		ИЛИ ВариантРаспределения = Перечисления.СпособыРаспределенияСтатейРасходов.ПоЭтапамВручнуюПоВсемПодразделениям
		ИЛИ ВариантРаспределения = Перечисления.СпособыРаспределенияСтатейРасходов.НаДругиеСтатьиРасходов Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяКалькуляции");
	КонецЕсли;
	
	Если ВариантРаспределения = Перечисления.СпособыРаспределенияСтатейРасходов.НаДругиеСтатьиРасходов 
		И Списание.Количество() = 0 Тогда
		СообщитьОбОшибке(НСтр("ru='Не введено ни одной строки в список ""На другие статьи расходов""';uk='Не введено жодного рядка в список ""На інші статті витрат""'"), Отказ);
	КонецЕсли;
	
	Если ВариантРаспределения = Перечисления.СпособыРаспределенияСтатейРасходов.ПоПодразделениямВручнуюПоЭтапамПоПравилу
		И ПоБазе.Количество() = 0 Тогда
		СообщитьОбОшибке(НСтр("ru='Не введено ни одной строки в список ""По подразделениям вручную""';uk='Не введено жодного рядка в список ""По підрозділах вручну""'"), Отказ);
	КонецЕсли;
	
	РеквизитТЧСписание = Новый Массив;
	СтруктураТЧСписание = Новый Структура;
	СтруктураТЧСписание.Вставить("Списание", "СтатьяРасходов, АналитикаРасходов");
	РеквизитТЧСписание.Добавить(СтруктураТЧСписание);
	ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
		ЭтотОбъект, РеквизитТЧСписание, МассивНепроверяемыхРеквизитов, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СообщитьОбОшибке(ТекстОшибки, Отказ)
	
	Ошибки = Новый Структура;
	Ошибки.Вставить("СписокОшибок", Новый Массив);
	Ошибки.Вставить("ГруппыОшибок", Новый Соответствие);
	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
				Ошибки,
				"Объект.ПравилоРаспределенияПоЭтапам",
				ТекстОшибки,
				"");
	Если Ошибки.СписокОшибок.Количество() <> 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
